RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cryptolite_vu.h
/*******************************************************************************
* Function Name: Cy_Cryptolite_Vu_xmul_hw
****************************************************************************//**
*
* Performs carry less long integer multiplication operation. 
* \note  The pointers p_a, p_b & p_z must be 4 byte aligned and end in 4 byte boundary.
* \note  User should use the function CY_REMAP_ADDRESS_CRYPTOLITE() to get the remapped address and use it for all the VU operations.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param p_struct
* The pointer to the cy_stc_cryptolite_descr_t.
*
* \param p_z
* The buffer pointer to the store the output.
*
* \param word_size_z
* The size of the p_z buffer in word size.
*
* \param p_a
* The pointer to the first operand buffer.
*
* \param word_size_a
* The size of the p_a buffer in word size.

* \param p_b
* The pointer to the second operand buffer.
*
* \param word_size_b
* The size of the p_b buffer in word size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Vu_xmul_hw
*******************************************************************************/
__STATIC_INLINE cy_en_cryptolite_status_t Cy_Cryptolite_Vu_xmul_hw (CRYPTOLITE_Type *base, cy_stc_cryptolite_descr_t* p_struct, uint8_t* p_z,
                                            uint32_t word_size_z,
                                            uint8_t* p_a,
                                            uint32_t word_size_a,
                                            uint8_t* p_b,
                                            uint32_t word_size_b)
{
   p_struct->data0 = (uint32_t) ((uint32_t)4 << 28U) | ((word_size_z-1U) << 16U) | ((word_size_b-1U) << 8U) | (word_size_a-1U);
   p_struct->data1 = (uint32_t) p_a;
   p_struct->data2 = (uint32_t) p_b;
   p_struct->data3 = (uint32_t) p_z;
   return Cy_Cryptolite_Vu_RunInstr(base, p_struct);
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Vu_add_hw
****************************************************************************//**
*
* Performs long integer addition operation. 
* \note  The pointers p_a, p_b & p_z must be 4 byte aligned and end in 4 byte boundary.
* \note  User should use the function CY_REMAP_ADDRESS_CRYPTOLITE() to get the remapped address and use it for all the VU operations.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param p_struct
* The pointer to the cy_stc_cryptolite_descr_t.
*
* \param p_z
* The buffer pointer to the store the output.
*
* \param word_size_z
* The size of the p_z buffer in word size.
*
* \param p_a
* The pointer to the first operand buffer.
*
* \param word_size_a
* The size of the p_a buffer in word size.

* \param p_b
* The pointer to the second operand buffer.
*
* \param word_size_b
* The size of the p_b buffer in word size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Vu_add_hw
*******************************************************************************/
__STATIC_INLINE cy_en_cryptolite_status_t Cy_Cryptolite_Vu_add_hw (CRYPTOLITE_Type *base, cy_stc_cryptolite_descr_t *p_struct, uint8_t* p_z,
                                            uint32_t word_size_z,
                                            uint8_t* p_a,
                                            uint32_t word_size_a,
                                            uint8_t* p_b,
                                            uint32_t word_size_b)
{
   p_struct->data0 = (uint32_t) ((uint32_t)1 << 28U) | ((word_size_z-1U) << 16U) | ((word_size_b-1U) << 8U) | (word_size_a-1U);
   p_struct->data1 = (uint32_t) p_a;
   p_struct->data2 = (uint32_t) p_b;
   p_struct->data3 = (uint32_t) p_z;
   /*run instruction*/
   return Cy_Cryptolite_Vu_RunInstr(base, p_struct);
}


/*******************************************************************************
* Function Name: Cy_Cryptolite_Vu_sub_hw
****************************************************************************//**
*
* Performs long integer subtraction operation.
* \note  The pointers p_a, p_b & p_z must be 4 byte aligned and end in 4 byte boundary.
* \note  User should use the function CY_REMAP_ADDRESS_CRYPTOLITE() to get the remapped address and use it for all the VU operations.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param p_struct
* The pointer to the cy_stc_cryptolite_descr_t.
*
* \param p_z
* The buffer pointer to the store the output.
*
* \param word_size_z
* The size of the p_z buffer in word size.
*
* \param p_a
* The pointer to the first operand buffer.
*
* \param word_size_a
* The size of the p_a buffer in word size.

* \param p_b
* The pointer to the second operand buffer.
*
* \param word_size_b
* The size of the p_b buffer in word size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Vu_sub_hw
*******************************************************************************/
__STATIC_INLINE cy_en_cryptolite_status_t Cy_Cryptolite_Vu_sub_hw (CRYPTOLITE_Type *base, cy_stc_cryptolite_descr_t *p_struct, uint8_t* p_z,
                                            uint32_t word_size_z,
                                            uint8_t* p_a,
                                            uint32_t word_size_a,
                                            uint8_t* p_b,
                                            uint32_t word_size_b)
{
   p_struct->data0 = (uint32_t) ((uint32_t)2 << 28U) | ((word_size_z-1U) << 16U) | ((word_size_b-1U) << 8U) | (word_size_a-1U);
   p_struct->data1 = (uint32_t) p_a;
   p_struct->data2 = (uint32_t) p_b;
   p_struct->data3 = (uint32_t) p_z;
   return Cy_Cryptolite_Vu_RunInstr(base, p_struct);
}



/*******************************************************************************
* Function Name: Cy_Cryptolite_Vu_mov_hw
****************************************************************************//**
*
* Performs long integer move operation.
* \note  The pointers p_a & p_z must be 4 byte aligned and end in 4 byte boundary.
* \note  User should use the function CY_REMAP_ADDRESS_CRYPTOLITE() to get the remapped address and use it for all the VU operations.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param p_struct
* The pointer to the cy_stc_cryptolite_descr_t.
*
* \param p_z
* The buffer pointer to the store the output.
*
* \param word_size_z
* The size of the p_z buffer in word size.
*
* \param p_a
* The pointer to the operand buffer.
*
* \param word_size_a
* The size of the p_a buffer in word size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_Vu_mov_hw
*******************************************************************************/
__STATIC_INLINE cy_en_cryptolite_status_t Cy_Cryptolite_Vu_mov_hw (CRYPTOLITE_Type *base, cy_stc_cryptolite_descr_t *p_struct, uint8_t* p_z,
                                            uint32_t word_size_z,
                                            uint8_t* p_a,
                                            uint32_t word_size_a)
{
   p_struct->data0 = (uint32_t) (9UL << 28U) | ((word_size_z-1U) << 16U) | (word_size_a-1U);
   p_struct->data1 = (uint32_t) p_a;
   p_struct->data3 = (uint32_t) p_z;
   return Cy_Cryptolite_Vu_RunInstr(base, p_struct);
}




