RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cryptolite_vu.h
/*******************************************************************************
* Function Name: Cy_Cryptolite_Vu_cond_sub_hw
****************************************************************************//**
*
* Performs long integer conditional subtraction operation.
* \note  The pointers p_a, p_b & p_z must be 4 byte aligned and end in 4 byte boundary.
* \note  User should use the function CY_REMAP_ADDRESS_CRYPTOLITE() to get the remapped address and use it for all the VU operations.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param p_struct
* The pointer to the cy_stc_cryptolite_descr_t.
*
* \param p_z
* The buffer pointer to the store the output.
*
* \param word_size_z
* The size of the p_z buffer in word size.
*
* \param p_a
* The pointer to the first operand buffer.
*
* \param word_size_a
* The size of the p_a buffer in word size.

* \param p_b
* The pointer to the second operand buffer.
*
* \param word_size_b
* The size of the p_b buffer in word size.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
* \funcusage
* \snippet cryptolite/snippet/main.c snippet_Cy_Cryptolite_VU_cond_sub_hw
*******************************************************************************/
__STATIC_INLINE cy_en_cryptolite_status_t Cy_Cryptolite_Vu_cond_sub_hw (CRYPTOLITE_Type *base, cy_stc_cryptolite_descr_t* p_struct, uint8_t *p_z,
                                            uint32_t word_size_z,
                                            uint8_t *p_a,
                                            uint32_t word_size_a,
                                            uint8_t *p_b,
                                            uint32_t word_size_b)
{
   p_struct->data0 = (uint32_t) (8UL << 28U) | ((word_size_z-1U) << 16U) | ((word_size_b-1U) << 8U) | (word_size_a-1U);
   p_struct->data1 = (uint32_t) p_a;
   p_struct->data2 = (uint32_t) p_b;
   p_struct->data3 = (uint32_t) p_z;
   return Cy_Cryptolite_Vu_RunInstr(base, p_struct);
}

/** \} group_cryptolite_lld_vu_functions */


/*******************************************************************************
* Function Name: Cy_Cryptolite_Vu_lsr1_carry_hw
****************************************************************************//**
*
* Performs right shifting of long integer by shift bits with carry.
* \note  The pointers p_a & p_z must be 4 byte aligned and end in 4 byte boundary.
*
* \param base
* The pointer to a Cryptolite instance.
*
* \param p_struct
* The pointer to the cy_stc_cryptolite_descr_t.
*
* \param p_z
* The buffer pointer to the store the output.
*
* \param word_size_z
* The size of the p_z buffer in word size.
*
* \param p_a
* The pointer to the operand buffer.
*
* \param word_size_a
* The size of the p_a buffer in word size.
*
* \param carry
* To set carry value to the bit.
*
* \param bitsize
* The size of the p_z buffer in bits.
*
* \return status code. See \ref cy_en_cryptolite_status_t.
*
*******************************************************************************/
__STATIC_INLINE cy_en_cryptolite_status_t Cy_Cryptolite_Vu_lsr1_carry_hw (CRYPTOLITE_Type *base, cy_stc_cryptolite_descr_t* p_struct, uint8_t *p_z,
                                            uint32_t word_size_z,
                                            uint8_t *p_a,
                                            uint32_t word_size_a,
                                            uint32_t carry,
                                            uint32_t bitsize)
{
   cy_en_cryptolite_status_t status;
   p_struct->data0 = (uint32_t) ((uint32_t)5 << 28U) | ((word_size_z-1U) << 16U) |  ((word_size_a-1U) << 8U) |(word_size_a-1U);
   p_struct->data1 = (uint32_t) p_a;
   p_struct->data2 = (uint32_t) p_a;
   p_struct->data3 = (uint32_t) p_z;

   status = Cy_Cryptolite_Vu_RunInstr(base, p_struct);
   Cy_Cryptolite_Vu_wait_hw(base);
   if(CY_CRYPTOLITE_SUCCESS !=status)
   {
      return status;
   }
   if((bool)carry)
   {
       Cy_Cryptolite_Vu_set_bit(p_z, bitsize-1U);
   }

   return status;
}


#endif /* #if (CPUSS_CRYPTOLITE_VU == 1) */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCRYPTOLITE */

#endif /* #if !defined (CY_CRYPTOLITE_VU_H) */

/* [] END OF FILE */
